// ------------------------------------------ 2

/**
 * Форматування посилання
 *
 * Напиши скрипт який перевіряє чи закінчується значення
 *  змінної link символом /. Якщо ні, додай до кінця
 *  значення link цей символ.
 * Використовуй конструкцію if...else.
 */

// let link = "https://my-site.ua/about";

// if(!link.endsWith("/")) {
//   console.log("ok");
//   link += "/";
// }

// console.log(link);






/**
 * Форматування посилання
 * Напиши скрипт який перевіряє чи закінчується значення
 * змінної link символом /. Якщо ні, додай до кінця
 * значення link цей символ, але тільки в тому випадку,
 * якщо в link є підрядок "my-site".
 * Використовуй конструкцію if...else або тернарний оператор.
 */


// let link = "https://my-site.ua/about";

// if(!link.endsWith("/") && link.includes("my-site")) {
//   console.log("ok");
//   link += "/";
// }

// console.log(link);




// -------------------------------------- 4

/**
 * Напиши цикл for, який виводить у консоль браузера
 * числа за зростанням від a до b, але тільки якщо число кратне 5.
 */

// const a = 20;
// const b = 100;

// for(let i = a; i < b; i++) {
//   if(!(i % 5)) {
//     console.log(i);
//   }
// }







/*
 * Напиши скрипт, який підраховує суму всіх парних чисел,
 * які входять в діапазон чисел у змінних від min до max.
 * Наприклад, якщо min=0 и max=5, то діапазон 0-5, і в 
 * ньому два парних числа - 2 і 4, їх сума 6.
 */



// for(let i = min; i <= max; i++) {
//   if(!(i % 2)) {
//     total += i;
//   }
// }


// for(let i = min; i <= max; i++) {
//   if(i % 2) {
//     continue;
//   }

//   total += i;
// }

// console.log(total);


// function sum(min, max) {
//   let total = 0;

//   for(let i = min; i <= max; i++) {
//     if(!(i % 2)) {
//       total += i;
//     }
//   }

//   return total;
// }

// console.log(sum(0, 10));